app/controllers/admin/colors_controller.rb

INSERT INTO `colors` (`created_at`, `name`, `updated_at`) VALUES ('2014-06-12 16:23:39', 'Aqua', '2014-06-12 16:23:39')
SELECT  `colors`.* FROM `colors`  WHERE `colors`.`name` = 'Aqua'  ORDER BY `colors`.`id` ASC LIMIT 1
---
  def create
    @color = Color.where(name: color_params[:name]).first_or_create