app/controllers/admin/products_controller.rb

  def index
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def edit
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 3 LIMIT 1

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `taxable` = 0, `updated_at` = '2014-06-12 16:23:50' WHERE `products`.`id` = 2

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO `products` (`category_id`, `created_at`, `long_description`, `material_id`, `meta_description`, `name`, `page_title`, `shape_id`, `short_description`, `taxable`, `updated_at`, `vendor_id`) VALUES (2, '2014-06-12 16:23:37', 'Something', 2, 'My Meta Description', 'Lorem', 'My Page Title', 2, 'Ipsum', 1, '2014-06-12 16:23:37', 2)