app/views/checkouts/show.html.erb

SELECT  `carts`.* FROM `carts`  WHERE `carts`.`user_id` = 178 LIMIT 1
SELECT `cart_items`.* FROM `cart_items`  WHERE `cart_items`.`cart_id` = 220
---
<% current_or_guest_user.cart.cart_items.each do |cart_item| %>

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 47  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 37 LIMIT 1
---
		Product Name: <%= cart_item.variant.product.name %>
		Size: <%= cart_item.variant.size.name %>