app/views/admin/products/_products_color.html.erb

	<% if pc.object.new_record? %>
		<!-- <%= pc.collection_select :color_id, Color.all, :id, :name %> -->
---
SELECT `colors`.* FROM `colors`

	<ul class="sorted_product_image_list">
	<% pc.object.product_images.each do |product_image| %>
---
SELECT `product_images`.* FROM `product_images`  WHERE `product_images`.`products_color_id` = 1  ORDER BY sort_order ASC

			<% if v.object.new_record? %>
				<%= v.collection_select :size_id, Size.all, :id, :name, {}, {class: "size_select"} %>
			<% else %>
				<%= v.object.size.name %>
---
SELECT `sizes`.* FROM `sizes`   ORDER BY sort_order ASC
SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 1  ORDER BY sort_order ASC LIMIT 1